FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_GPIO.c
/*-------------------------------------------------------------------------*
 * File:  RX63N_GPIO.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the RX63N:GPIO:Interface.
 * Implementation:
 *      A single GPIO0 is created, but the code can be easily changed for
 *      other processors to use multiple GPIO busses.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <Types/GPIO.h>
#include <HAL/GPIO.h>
#include <Source/Processor/Renesas/RX63N/RX63N_GPIO.h>
#include <stdio.h>

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TUInt8 *iPDR;  // Port Direction Register (input or output)
    TUInt8 *iPODR; // Port Output Data Register
    TUInt8 *iPIDR; // Port Input Data Register
    TUInt8 *iPMR;  // Input Buffer Control Register
	TUInt8 *iODR0; // Open-Drain Control Register 0
	TUInt8 *iODR1; // Open-Drain Control Register 1
    TUInt8 *iPCR;  // Pull-Up Resister Control Register
    TUInt8 *iDSCR; // Drive Capacity Control Register
} RX63N_GPIO_PInfo;

typedef struct {
    const HAL_GPIOPort *iHAL;
    const RX63N_GPIO_PInfo *iPortInfo;
	TUInt8 iLocked;
} T_RX63N_GPIO_Workspace;


const RX63N_GPIO_PInfo GPIO_RX63N_Port0_PortInfo = {
    (TUInt8 *)&PORT0.PDR,
    (TUInt8 *)&PORT0.PODR,
    (TUInt8 *)&PORT0.PIDR,
    (TUInt8 *)&PORT0.PMR,
    (TUInt8 *)&PORT0.ODR0,
    (TUInt8 *)&PORT0.ODR1,
	(TUInt8 *)&PORT0.PCR,
	(TUInt8 *)&PORT0.DSCR 
};

const RX63N_GPIO_PInfo GPIO_RX63N_Port1_PortInfo = {
    (TUInt8 *)&PORT1.PDR,
    (TUInt8 *)&PORT1.PODR,
    (TUInt8 *)&PORT1.PIDR,
    (TUInt8 *)&PORT1.PMR,
    (TUInt8 *)&PORT1.ODR0,
    (TUInt8 *)&PORT1.ODR1,
	(TUInt8 *)&PORT1.PCR,
	(TUInt8 *)0 
};

const RX63N_GPIO_PInfo GPIO_RX63N_Port2_PortInfo = {
    (TUInt8 *)&PORT2.PDR,
    (TUInt8 *)&PORT2.PODR,
    (TUInt8 *)&PORT2.PIDR,
    (TUInt8 *)&PORT2.PMR,
    (TUInt8 *)&PORT2.ODR0,
    (TUInt8 *)&PORT2.ODR1,
	(TUInt8 *)&PORT2.PCR,
	(TUInt8 *)&PORT2.DSCR
};

const RX63N_GPIO_PInfo GPIO_RX63N_Port3_PortInfo = {
    (TUInt8 *)&PORT3.PDR,
    (TUInt8 *)&PORT3.PODR,
    (TUInt8 *)&PORT3.PIDR,
    (TUInt8 *)&PORT3.PMR,
    (TUInt8 *)&PORT3.ODR0,
    (TUInt8 *)&PORT3.ODR1,
	(TUInt8 *)&PORT3.PCR,
	(TUInt8 *)0 
};

const RX63N_GPIO_PInfo GPIO_RX63N_Port4_PortInfo = {
    (TUInt8 *)&PORT4.PDR,
    (TUInt8 *)&PORT4.PODR,
    (TUInt8 *)&PORT4.PIDR,
    (TUInt8 *)&PORT4.PMR,
    (TUInt8 *)&PORT4.ODR0,
    (TUInt8 *)&PORT4.ODR1,
	(TUInt8 *)&PORT4.PCR,
	(TUInt8 *)0 
};

const RX63N_GPIO_PInfo GPIO_RX63N_Port5_PortInfo = {
    (TUInt8 *)&PORT5.PDR,
    (TUInt8 *)&PORT5.PODR,
    (TUInt8 *)&PORT5.PIDR,
    (TUInt8 *)&PORT5.PMR,
    (TUInt8 *)&PORT5.ODR0,
    (TUInt8 *)&PORT5.ODR1,
	(TUInt8 *)&PORT5.PCR,
	(TUInt8 *)&PORT0.DSCR
};

const RX63N_GPIO_PInfo GPIO_RX63N_Port6_PortInfo = {
    (TUInt8 *)&PORT6.PDR,
    (TUInt8 *)&PORT6.PODR,
    (TUInt8 *)&PORT6.PIDR,
    (TUInt8 *)&PORT6.PMR,
    (TUInt8 *)&PORT6.ODR0,
    (TUInt8 *)&PORT6.ODR1,
	(TUInt8 *)&PORT6.PCR,
	(TUInt8 *)0
};

const RX63N_GPIO_PInfo GPIO_RX63N_Port7_PortInfo = {
    (TUInt8 *)&PORT7.PDR,
    (TUInt8 *)&PORT7.PODR,
    (TUInt8 *)&PORT7.PIDR,
    (TUInt8 *)&PORT7.PMR,
    (TUInt8 *)&PORT7.ODR0,
    (TUInt8 *)&PORT7.ODR1,
	(TUInt8 *)&PORT7.PCR,
	(TUInt8 *)0
};

const RX63N_GPIO_PInfo GPIO_RX63N_Port8_PortInfo = {
    (TUInt8 *)&PORT8.PDR,
    (TUInt8 *)&PORT8.PODR,
    (TUInt8 *)&PORT8.PIDR,
    (TUInt8 *)&PORT8.PMR,
    (TUInt8 *)&PORT8.ODR0,
    (TUInt8 *)&PORT8.ODR1,
	(TUInt8 *)&PORT8.PCR,
	(TUInt8 *)0
};

const RX63N_GPIO_PInfo GPIO_RX63N_Port9_PortInfo = {
    (TUInt8 *)&PORT9.PDR,
    (TUInt8 *)&PORT9.PODR,
    (TUInt8 *)&PORT9.PIDR,
    (TUInt8 *)&PORT9.PMR,
    (TUInt8 *)&PORT9.ODR0,
    (TUInt8 *)&PORT9.ODR1,
	(TUInt8 *)&PORT9.PCR,
	(TUInt8 *)&PORT9.DSCR
};

const RX63N_GPIO_PInfo GPIO_RX63N_PortA_PortInfo = {
    (TUInt8 *)&PORTA.PDR,
    (TUInt8 *)&PORTA.PODR,
    (TUInt8 *)&PORTA.PIDR,
    (TUInt8 *)&PORTA.PMR,
    (TUInt8 *)&PORTA.ODR0,
    (TUInt8 *)&PORTA.ODR1,
	(TUInt8 *)&PORTA.PCR,
	(TUInt8 *)&PORTA.DSCR
};

const RX63N_GPIO_PInfo GPIO_RX63N_PortB_PortInfo = {
    (TUInt8 *)&PORTB.PDR,
    (TUInt8 *)&PORTB.PODR,
    (TUInt8 *)&PORTB.PIDR,
    (TUInt8 *)&PORTB.PMR,
    (TUInt8 *)&PORTB.ODR0,
    (TUInt8 *)&PORTB.ODR1,
	(TUInt8 *)&PORTB.PCR,
	(TUInt8 *)&PORTB.DSCR
};

const RX63N_GPIO_PInfo GPIO_RX63N_PortC_PortInfo = {
    (TUInt8 *)&PORTC.PDR,
    (TUInt8 *)&PORTC.PODR,
    (TUInt8 *)&PORTC.PIDR,
    (TUInt8 *)&PORTC.PMR,
    (TUInt8 *)&PORTC.ODR0,
    (TUInt8 *)&PORTC.ODR1,
	(TUInt8 *)&PORTC.PCR,
	(TUInt8 *)&PORTC.DSCR
};

const RX63N_GPIO_PInfo GPIO_RX63N_PortD_PortInfo = {
    (TUInt8 *)&PORTD.PDR,
    (TUInt8 *)&PORTD.PODR,
    (TUInt8 *)&PORTD.PIDR,
    (TUInt8 *)&PORTD.PMR,
    (TUInt8 *)&PORTD.ODR0,
    (TUInt8 *)&PORTD.ODR1,
	(TUInt8 *)&PORTD.PCR,
	(TUInt8 *)&PORTD.DSCR
};

const RX63N_GPIO_PInfo GPIO_RX63N_PortE_PortInfo = {
    (TUInt8 *)&PORTE.PDR,
    (TUInt8 *)&PORTE.PODR,
    (TUInt8 *)&PORTE.PIDR,
    (TUInt8 *)&PORTE.PMR,
    (TUInt8 *)&PORTE.ODR0,
    (TUInt8 *)&PORTE.ODR1,
	(TUInt8 *)&PORTE.PCR,
	(TUInt8 *)&PORTE.DSCR
};

const RX63N_GPIO_PInfo GPIO_RX63N_PortF_PortInfo = {
    (TUInt8 *)&PORTF.PDR,
    (TUInt8 *)&PORTF.PODR,
    (TUInt8 *)&PORTF.PIDR,
    (TUInt8 *)&PORTF.PMR,
    (TUInt8 *)&PORTF.ODR0,
    (TUInt8 *)&PORTF.ODR1,
	(TUInt8 *)&PORTF.PCR,
	(TUInt8 *)0
};

