FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_GPIO.c
const RX63N_GPIO_PInfo GPIO_RX63N_PortG_PortInfo = {
    (TUInt8 *)&PORTG.PDR,
    (TUInt8 *)&PORTG.PODR,
    (TUInt8 *)&PORTG.PIDR,
    (TUInt8 *)&PORTG.PMR,
    (TUInt8 *)&PORTG.ODR0,
    (TUInt8 *)&PORTG.ODR1,
	(TUInt8 *)&PORTG.PCR,
	(TUInt8 *)&PORTG.DSCR
};

const RX63N_GPIO_PInfo GPIO_RX63N_PortJ_PortInfo = {
    (TUInt8 *)&PORTJ.PDR,
    (TUInt8 *)&PORTJ.PODR,
    (TUInt8 *)&PORTJ.PIDR,
    (TUInt8 *)&PORTJ.PMR,
    (TUInt8 *)&PORTJ.ODR0,
    (TUInt8 *)&PORTJ.ODR1,
	(TUInt8 *)&PORTJ.PCR,
	(TUInt8 *)0
};

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port0 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P0_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port0_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port1 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P1_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port1_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port2 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P2_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port2_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P3_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port3 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P3_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port3_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P4_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port4 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P4_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port4_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P5_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port5 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P5_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port5_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P6_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port6 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P6_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port6_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P7_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port7 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P7_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port7_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P8_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port8 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P8_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port8_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_P9_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:Port9 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_P9_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_Port9_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_PA_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:PortA workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_PA_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_PortA_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_PB_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:PortB workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_PB_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_PortB_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_PC_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:PortC workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_PC_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_PortC_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_PD_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:PortD workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_PD_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_PortD_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_PE_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:PortE workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_PE_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_PortE_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_PF_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:PortF workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_PF_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_PortF_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_PG_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N:GPIO:PortG workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_PG_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX63N_PortG_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are usable.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aUsablePins         -- Pins allowed
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_Configure(void *aWorkspace, TUInt32 aUsablePins)
{
    //    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
	
    PARAM_NOT_USED(aUsablePins);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_Activate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are active as GPIO pins.
 *      Once active, the pins are set to GPIO inputs or outputs.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_Activate(void *aWorkspace, TUInt32 aPortPins)
{
    // Defunc function
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_Deactivate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are inactive as GPIO pins.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_Deactivate(void *aWorkspace, TUInt32 aPortPins)
{
    // Defunc function
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_SetOutputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_SetOutputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    const RX63N_GPIO_PInfo *p_info = p->iPortInfo;

    // Make sure this port has data direction support
    if (!p_info->iPDR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

