FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_GPIO.c
    // Output mode is set by putting 1's in the IODIR register
    (*p_info->iPDR) |= aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_SetInputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be input mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be input mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_SetInputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    const RX63N_GPIO_PInfo *p_info = p->iPortInfo;

    // Make sure this port has data direction support
    if (!p_info->iPDR)
        return UEZ_ERROR_ILLEGAL_OPERATION;   

    // Input mode is set by putting 0's in the IODIR register
    // Make those bits 0
    (*p_info->iPDR) &= ~aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_Set
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output HIGH.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_Set(void *aWorkspace, TUInt32 aPortPins)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    const RX63N_GPIO_PInfo *p_info = p->iPortInfo;

    // Make sure this port has output support
    if (!p_info->iPODR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

    // Set the bits corresponding to those pins
    (*p_info->iPODR) |= aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_Clear
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output LOW.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_Clear(void *aWorkspace, TUInt32 aPortPins)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    const RX63N_GPIO_PInfo *p_info = p->iPortInfo;

    // Make sure this port has output support
    if (!p_info->iPODR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

    // Set the bits corresponding to those pins
    (*p_info->iPODR) &= ~aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_Read
 *---------------------------------------------------------------------------*
 * Description:
 *      Read a group of GPIO pins.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 *      TUInt32 *aPinsRead          -- Pointer to pins result.
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_Read(
    void *aWorkspace,
    TUInt32 aPortPins,
    TUInt32 *aPinsRead)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    const RX63N_GPIO_PInfo *p_info = p->iPortInfo;

    // Make sure this port has input support
    if (!p_info->iPIDR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

    // Get the bits
    *aPinsRead = ((*p_info->iPIDR) & aPortPins);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_SetPull
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 *      T_gpioPull aPull            -- Type of pull
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_SetPull(
    void *aWorkspace,
    TUInt8 aPortPinIndex,
    T_gpioPull aPull)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    const RX63N_GPIO_PInfo *p_info = p->iPortInfo;

    if (aPortPinIndex >= 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Make sure this port has pull-up support
    if (!p_info->iPCR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

    // Only pull up or no pull is allowed
    if ((aPull == GPIO_PULL_UP) || (aPull == GPIO_PULL_NONE)) {
        // Set the pull up to on or off
        if (aPull == GPIO_PULL_UP) {
            (*p_info->iPCR) |= (1 << aPortPinIndex);
        } else {
            // Turn off the pull up
            (*p_info->iPCR) &= ~(1 << aPortPinIndex);
        }
    } else {
        // Incorrect pull up type
        return UEZ_ERROR_ILLEGAL_OPERATION;
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_SetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pin's mux feature.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-7
 *      T_gpioMux aMux              -- 0 for open drain off, 1 for open drain on
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_SetMux(
    void *aWorkspace,
    TUInt8 aPortPinIndex,
    T_gpioMux aMux)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    const RX63N_GPIO_PInfo *p_info = p->iPortInfo;

