FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_GPIO.c
    if (aPortPinIndex >= 8)
        return UEZ_ERROR_INVALID_PARAMETER;
    if (aMux > 1)
        return UEZ_ERROR_INVALID_PARAMETER;

	if (!p_info->iPMR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

	// Set port mode register
    if (aMux == 0) {
		// Set the pin as a general I/O pin
        (*p_info->iPMR) &= ~(1 << aPortPinIndex);
		
    } else {
        // Set the pin as an I/O port for peripheral functions.
        (*p_info->iPMR) |= (1 << aPortPinIndex); 
    }
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_GPIO_GetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Get pin's mux feature.  1=peripheral pin, 0=generic GPIO pin
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-7
 *      T_gpioMux *aMux             -- Returned mux option (0=io pin, 1=peripheral)
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_GPIO_GetMux(
    void *aWorkspace,
    TUInt8 aPortPinIndex,
    T_gpioMux *aMux)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    const RX63N_GPIO_PInfo *p_info = p->iPortInfo;

    // Default is generic i/o
    *aMux = 0;

    if (aPortPinIndex >= 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    if (!p_info->iPMR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

    // Set port mode register
    if ((*p_info->iPMR) & (1 << aPortPinIndex)) {
        // Pin is for peripheral functions.
        *aMux = 1;
    } else {
        // Pin is for general I/O
        *aMux = 0;
    }

    return UEZ_ERROR_NONE;
}

T_uezError RX63N_GPIO_Control(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioControl aControl,
        TUInt32 aValue)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    const RX63N_GPIO_PInfo *p_info = p->iPortInfo;

    PARAM_NOT_USED(aValue);

	if (aPortPinIndex >= 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Look up the IOCON register
    switch (aControl) {
        case GPIO_NOP:
            // Yep, do no operation
            break;
        case GPIO_CONTROL_ENABLE_INPUT_BUFFER:
            // Not Implemented
            break;
        case GPIO_CONTROL_DISABLE_INPUT_BUFFER:
            // Not Implemented
            break;
		case GPIO_CONTROL_ENABLE_OPEN_DRAIN:
			if (!p_info->iODR0)
        		return UEZ_ERROR_ILLEGAL_OPERATION;
				
            (*p_info->iODR0) |= (1 << aPortPinIndex);
            break;
		case GPIO_CONTROL_DISABLE_OPEN_DRAIN:
			if (!p_info->iODR0)
        		return UEZ_ERROR_ILLEGAL_OPERATION;
				
            (*p_info->iODR0) &= ~(1 << aPortPinIndex);
            break;
		case GPIO_CONTROL_SET_CONFIG_BITS:
			// Not Implemented
			break;		
        default:
            return UEZ_ERROR_NOT_SUPPORTED;
    }
    return UEZ_ERROR_NONE;
}

T_uezError RX63N_GPIO_ConfigureInterruptCallbackNotSupported(
    void *aWorkspace,
    TUInt32 aPortPins,
    T_gpioInterruptHandler iInterruptCallback,
    void *iInterruptCallbackWorkspace)
{
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError RX63N_GPIO_EnableInterruptsNotSupported(
    void *aWorkspace,
    TUInt32 aPortPins,
    T_gpioInterruptType aType)
{
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError RX63N_GPIO_DisableInterruptsNotSupported(
    void *aWorkspace,
    TUInt32 aPortPins,
    T_gpioInterruptType aType)
{
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError RX63N_GPIO_ClearInterruptsNotSupported(
    void *aWorkspace,
    TUInt32 aPortPins)
{
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError RX63N_GPIO_Lock(void *aWorkspace, TUInt32 aPortPins)
{
#ifndef NDEBUG
    char buffer [50];
#endif
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;
    // Any pins already locked?
    if (p->iLocked & aPortPins) {
        #ifndef NDEBUG
          sprintf (buffer, "PinLock on %s Pin %d", p->iHAL->iInterface.iName, aPortPins);
          UEZFailureMsg(buffer);
        #else
          UEZFailureMsg("PinLock");
        #endif
        return UEZ_ERROR_NOT_AVAILABLE;
    }
    p->iLocked |= aPortPins;
    return UEZ_ERROR_NONE;
}

T_uezError RX63N_GPIO_Unlock(void *aWorkspace, TUInt32 aPortPins)
{
    T_RX63N_GPIO_Workspace *p = (T_RX63N_GPIO_Workspace *)aWorkspace;

    p->iLocked &= ~aPortPins;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_GPIOPort GPIO_RX63N_Port0_Interface = {
    "RX63N:GPIO:Port 0",
    0x0100,
    RX63N_GPIO_P0_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
	RX63N_GPIO_Unlock,
	/* uEZ v2.04 */
	RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_Port1_Interface = {
    "RX63N:GPIO:Port 1",
    0x0100,
    RX63N_GPIO_P1_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_Port2_Interface = {
    "RX63N:GPIO:Port 2",
    0x0100,
    RX63N_GPIO_P2_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_Port3_Interface = {
    "RX63N:GPIO:Port 3",
    0x0100,
    RX63N_GPIO_P3_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_Port4_Interface = {
    "RX63N:GPIO:Port 4",
    0x0100,
    RX63N_GPIO_P4_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_Port5_Interface = {
    "RX63N:GPIO:Port 5",
    0x0100,
    RX63N_GPIO_P5_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_Port6_Interface = {
    "RX63N:GPIO:Port 6",
    0x0100,
    RX63N_GPIO_P6_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_Port7_Interface = {
    "RX63N:GPIO:Port 7",
    0x0100,
    RX63N_GPIO_P7_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_Port8_Interface = {
    "RX63N:GPIO:Port 8",
    0x0100,
    RX63N_GPIO_P8_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_Port9_Interface = {
    "RX63N:GPIO:Port 9",
    0x0100,
    RX63N_GPIO_P9_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

