FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_GPIO.c
const HAL_GPIOPort GPIO_RX63N_PortA_Interface = {
    "RX63N:GPIO:Port A",
    0x0100,
    RX63N_GPIO_PA_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_PortB_Interface = {
    "RX63N:GPIO:Port B",
    0x0100,
    RX63N_GPIO_PB_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_PortC_Interface = {
    "RX63N:GPIO:Port C",
    0x0100,
    RX63N_GPIO_PC_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_PortD_Interface = {
    "RX63N:GPIO:Port D",
    0x0100,
    RX63N_GPIO_PD_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_PortE_Interface = {
    "RX63N:GPIO:Port E",
    0x0100,
    RX63N_GPIO_PE_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_PortF_Interface = {
    "RX63N:GPIO:Port F",
    0x0100,
    RX63N_GPIO_PF_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_PortG_Interface = {
    "RX63N:GPIO:Port G",
    0x0100,
    RX63N_GPIO_PG_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

const HAL_GPIOPort GPIO_RX63N_PortJ_Interface = {
    "RX63N:GPIO:Port J",
    0x0100,
    RX63N_GPIO_PG_InitializeWorkspace,
    sizeof(T_RX63N_GPIO_Workspace),

    0,
    0,
    0,
    RX63N_GPIO_SetOutputMode,
    RX63N_GPIO_SetInputMode,
    RX63N_GPIO_Set,
    RX63N_GPIO_Clear,
    RX63N_GPIO_Read,
    RX63N_GPIO_SetPull,
    RX63N_GPIO_SetMux,

    RX63N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX63N_GPIO_EnableInterruptsNotSupported,
    RX63N_GPIO_DisableInterruptsNotSupported,
    RX63N_GPIO_ClearInterruptsNotSupported,

    RX63N_GPIO_Control,
	RX63N_GPIO_Lock,
    RX63N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX63N_GPIO_GetMux,
};

void RX63N_GPIO_P0_Require(void)
{
    HAL_GPIOPort **p_gpio0;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO0",
            (T_halInterface *)&GPIO_RX63N_Port0_Interface, 0,
            (T_halWorkspace **)&p_gpio0);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_0, p_gpio0);
}

void RX63N_GPIO_P1_Require(void)
{
    HAL_GPIOPort **p_gpio1;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO1",
            (T_halInterface *)&GPIO_RX63N_Port1_Interface, 0,
            (T_halWorkspace **)&p_gpio1);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_1, p_gpio1);
}

void RX63N_GPIO_P2_Require(void)
{
    HAL_GPIOPort **p_gpio2;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO2",
            (T_halInterface *)&GPIO_RX63N_Port2_Interface, 0,
            (T_halWorkspace **)&p_gpio2);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_2, p_gpio2);
}

