FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_GPIO.c
void RX63N_GPIO_P3_Require(void)
{
    HAL_GPIOPort **p_gpio3;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO3",
            (T_halInterface *)&GPIO_RX63N_Port3_Interface, 0,
            (T_halWorkspace **)&p_gpio3);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_3, p_gpio3);
}

void RX63N_GPIO_P4_Require(void)
{
    HAL_GPIOPort **p_gpio4;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO4",
            (T_halInterface *)&GPIO_RX63N_Port4_Interface, 0,
            (T_halWorkspace **)&p_gpio4);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_4, p_gpio4);
}

void RX63N_GPIO_P5_Require(void)
{
    HAL_GPIOPort **p_gpio5;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO5",
            (T_halInterface *)&GPIO_RX63N_Port5_Interface, 0,
            (T_halWorkspace **)&p_gpio5);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_5, p_gpio5);
}

void RX63N_GPIO_P6_Require(void)
{
    HAL_GPIOPort **p_gpio6;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO6",
            (T_halInterface *)&GPIO_RX63N_Port6_Interface, 0,
            (T_halWorkspace **)&p_gpio6);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_6, p_gpio6);
}

void RX63N_GPIO_P7_Require(void)
{
    HAL_GPIOPort **p_gpio7;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO7",
            (T_halInterface *)&GPIO_RX63N_Port7_Interface, 0,
            (T_halWorkspace **)&p_gpio7);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_7, p_gpio7);
}

void RX63N_GPIO_P8_Require(void)
{
    HAL_GPIOPort **p_gpio8;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO8",
            (T_halInterface *)&GPIO_RX63N_Port8_Interface, 0,
            (T_halWorkspace **)&p_gpio8);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_8, p_gpio8);
}

void RX63N_GPIO_P9_Require(void)
{
    HAL_GPIOPort **p_gpio9;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO9",
            (T_halInterface *)&GPIO_RX63N_Port9_Interface, 0,
            (T_halWorkspace **)&p_gpio9);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_9, p_gpio9);
}

void RX63N_GPIO_PA_Require(void)
{
    HAL_GPIOPort **p_gpioA;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOA",
            (T_halInterface *)&GPIO_RX63N_PortA_Interface, 0,
            (T_halWorkspace **)&p_gpioA);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_A, p_gpioA);
}

void RX63N_GPIO_PB_Require(void)
{
    HAL_GPIOPort **p_gpioB;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOB",
            (T_halInterface *)&GPIO_RX63N_PortB_Interface, 0,
            (T_halWorkspace **)&p_gpioB);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_B, p_gpioB);
}

void RX63N_GPIO_PC_Require(void)
{
    HAL_GPIOPort **p_gpioC;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOC",
            (T_halInterface *)&GPIO_RX63N_PortC_Interface, 0,
            (T_halWorkspace **)&p_gpioC);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_C, p_gpioC);
}

void RX63N_GPIO_PD_Require(void)
{
    HAL_GPIOPort **p_gpioD;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOD",
            (T_halInterface *)&GPIO_RX63N_PortD_Interface, 0,
            (T_halWorkspace **)&p_gpioD);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_D, p_gpioD);
}

void RX63N_GPIO_PE_Require(void)
{
    HAL_GPIOPort **p_gpioE;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOE",
            (T_halInterface *)&GPIO_RX63N_PortE_Interface, 0,
            (T_halWorkspace **)&p_gpioE);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_E, p_gpioE);
}

void RX63N_GPIO_PF_Require(void)
{
    HAL_GPIOPort **p_gpioF;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOF",
            (T_halInterface *)&GPIO_RX63N_PortF_Interface, 0,
            (T_halWorkspace **)&p_gpioF);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_F, p_gpioF);
}

void RX63N_GPIO_PG_Require(void)
{
    HAL_GPIOPort **p_gpioG;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOG",
            (T_halInterface *)&GPIO_RX63N_PortG_Interface, 0,
            (T_halWorkspace **)&p_gpioG);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_G, p_gpioG);
}

void RX63N_GPIO_PJ_Require(void)
{
    HAL_GPIOPort **p_gpioJ;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOJ",
            (T_halInterface *)&GPIO_RX63N_PortJ_Interface, 0,
            (T_halWorkspace **)&p_gpioJ);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_J, p_gpioJ);
}

/*-------------------------------------------------------------------------*
 * End of File:  GPIO.c
 *-------------------------------------------------------------------------*/
